Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E06A.tmx
Source language: en_us
Languages: zh_cn

source: Use Magnetic Nail Polish to Make DIY Tortoise Shell Sunglasses
zh_cn: 教你DIY一副太阳镜

source: We've all got those one dollar throw away Wayfarer style sunnies.
zh_cn: 我们只需花一美元就能获得时尚潮人们展示自己个性风采的必用道具。

source: Whether they were part of a halloween costume, a giveaway at a festival, or a survival tool at a super sunny summer wedding, it's likely you've got one, two, or maybe ten pairs of these classic shades lying around the house.
zh_cn: 无论是一款万圣节的服饰，一个节日的免费样品，或者是一款阳光明媚的夏季婚礼上的潮流必备物件，也许是你已经有一个，两个，或者是十对潮流物件放在家里。

source: Naturally, it's time to trick 'em out!
zh_cn: 显然，是时候拿出来潮一把了！

source: Materials:
zh_cn: 材料：

source: - sunglasses
zh_cn: -太阳镜

source: - magnetic nail polish (we used Sally Hansen and China Glaze)
zh_cn: -磁性指甲油（我们通常使用莎莉汉森的指甲油或者是中国釉）

source: - painter's tape
zh_cn: -涂漆用胶带

source: - optional: clear top coat
zh_cn: -过滤器：罩面漆

source: As always, gather your materials.
zh_cn: 首先，你要准备好所有这些用到的东东。

source: Make sure to grab some construction paper or scrap paper to work on.
zh_cn: 然后再拿一张建筑用纸或废纸上来操作。

source: For our first variety, we went for a straightforward tortoise shell pattern.
zh_cn: 在第一款太阳镜上，我们设计出了一种龟壳形状的图案。

source: Simply paint the sunglasses with the magnetic polish, use the magnet to create patterns, and you're done.
zh_cn: 首先在镜框上涂一层磁性指甲油。然后接下来使用指甲油磁铁设计出自己喜欢的图案。

source: For the sides, we rotated the magnet every so often to create a varied pattern.
zh_cn: 在太阳镜两边，我们通常是旋转磁铁来画出各种各样的图案。

source: So simple!
zh_cn: 就这么简单！

source: And so chic!
zh_cn: 这么时髦！

source: For folks who want to get a little fancier, go for stripes! For these we simply used painter's tape, snipped it up and created a pattern on the sides of the sunglasses.
zh_cn: 喜欢乐趣的美眉们，一起来设计条纹图案吧！我们只需要一条涂漆用胶带，就能在太阳镜框上设计出不同形状的图案。

source: Twist things up a bit by using different colored magnetic polishes and magnets so you can super crazy with patterns.
zh_cn: 使用不同颜色的指甲油和不同形状的磁铁，尽请的设计出各种各样的图案来！

source: Our second striped pair looks like a whole bunch of fun animal prints thrown together.
zh_cn: 我们设计的第二款太阳镜的图案看起来是不是很像动物皮的条纹呢！

source: So fun!
zh_cn: 这么好玩！

source: How do you trick out your sunglasses for summertime?
zh_cn: 夏天，你是怎么装饰你的太阳镜的呢？

source: Let us know in the comments below or over on Twitter.
zh_cn: 和我们一起分享吧！

source: And if a DIY isn't quite your jam, be sure to check out our roundup of hot shades for summer 2012 as well as all sorts of accessories for your sunnies.
zh_cn: 如果这些DIY的太阳镜不合你的胃口，那你可以到我们的网站预览2012年最新款太阳镜或者是各种你所需要的配件哦！
